GUID value of the UpdaterId
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public Guid GetGUID()
  Visual Basic
Public Function GetGUID As Guid
  Visual C++
public:
Guid GetGUID()
 See Also
  UpdaterId Class
  Autodesk.Revit.DB Namespace